/********************************
FindFiles.js - ver. 2012-12-22
Interface language
Language:      Russian (1049)
Translated by: Averin Andrey
*********************************/
sTxtScriptName  = "Поиск файлов";
sTxtDir         = "&Каталог";
sTxtCurrent     = "&Текущий";
sTxtBrowse      = "&Выбрать...";
sTxtSubDirs     = "Подкаталоги &уровень:";
sTxtAll         = "Все";
sTxtFileName    = "&Имя файла";
sTxtWildcards   = "(поддержка использования шаблонов: *?)";
sTxtRegExp      = "Регулярные выражения";
sTxtTextInFile  = "&Текст в файле";
sTxtNotName     = "Кроме этих имён";
sTxtMatchCase   = "С учетом регистра";
sTxtMultiline   = "Многострочно";
sTxtNotContain  = "Не содержащие текст";
sTxtInStreams   = "Включить NTFS потоки";
sTxtSkipBinary  = "Не искать в бинарных";
sTxtSkipLarger  = "Don't search\nin larger than:";                //new
sTxtFiles       = "Файлы";
sTxtSearch      = "Искать";
sTxtEdit        = "Правка";
sTxtCopyList    = "Копировать";
sTxtClearList   = "Очистить";
sTxtSettings    = "Настройки";
sTxtClose       = "Закрыть";
sTxtChooseDir   = "Выберите каталог:";
sTxtNoFiles     = "<нет файлов>";
sTxtSeparateWnd = "Запустить в отдельном окне";
sTxtKeepFiles   = "Вывод списка файлов";
sTxtPathShow    = "Показать полный путь в списке файлов";
sTxtDirNoExist  = "Каталог не существует.";
sTxtFileNoExist = "Файлы не существуют.";
sTxtErrorRE     = "Ошибка в регулярном выражении.";
sTxtNTFSStream  = "NTFS stream";                                  //new
sTxtWait        = "Подождите...";
sHlpAnyChar     = "any single character";                         //new
sHlpAnyString   = "any string of characters";                     //new
sHlpSemicolQuot = "semicolon must be in double quotes";           //new
sHlpListSepar   = "list separator (semicolon)";                   //new
sHlpAnyChar_NL  = "any character, except \\n";                    //new
sHlpDigit       = "digit [0-9]";                                  //new
sHlpNonDigit    = "non-digit [^0-9]";                             //new
sHlpWhiteSp     = "whitespace [ \\f\\n\\r\\t\\v]";                //new
sHlpNonWhiteSp  = "non-whitespace";                               //new
sHlpWordChar    = "word character [A-Za-z0-9_]";                  //new
sHlpNonWordChar = "non-word character";                           //new
sHlpNULL        = "NULL character";                               //new
sHlpFF          = "form feed \\x0C";                              //new
sHlpNL          = "new line \\x0A";                               //new
sHlpCR          = "carriage return \\x0D";                        //new
sHlpTab         = "tab \\x09";                                    //new
sHlpVTab        = "vertical tab \\x0B";                           //new
sHlpCharHex     = "character hex code FF";                        //new
sHlpUniCharHex  = "Unicode char hex code 00FF";                   //new
sHlpBegin       = "beginning of string/line";                     //new
sHlpEnd         = "end of string/line";                           //new
sHlpWordBoun    = "word boundary";                                //new
sHlpNonWordBoun = "non-word boundary";                            //new
sHlpAlternative = "alternative ab or xy";                         //new
sHlpCharSet     = "character set, any specified";                 //new
sHlpNegCharSet  = "negative character set";                       //new
sHlpRange       = "range of chars from a to z";                   //new
sHlpNegRange    = "negative range of chars";                      //new
sHlpCapture     = "capture";                                      //new
sHlpNotCapture  = "not capture";                                  //new
sHlpFollow      = "followed by ab";                               //new
sHlpNotFollow   = "not followed by ab";                           //new
sHlpBackrefer   = "backreference";                                //new
sHlpZeroOrOne   = "zero or one times";                            //new
sHlpZeroOrMore  = "zero or more times";                           //new
sHlpOneOrMore   = "one or more times";                            //new
sHlpexactly     = "exactly 3 times";                              //new
sHlpAtLeast     = "at least 3 times";                             //new
sHlpFromTo      = "from 3 to 7 times";                            //new
sHlpSpecChars   = "()[]{}^$.?+*|\\ special chars";                //new